{
  "backend/main.mo": "Motoko actor storing user-submitted contact messages keyed by Principal with submit, query, and retrieval functions plus static cafe info.",
  "feature_evidence.json": "Feature evidence report listing job-related feature requirements, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their purpose, styling, and roles in the app.",
  "frontend/index.css": "Tailwind base and theme CSS defining OKLCH color variables for light/dark modes with global styling rules.",
  "frontend/index.html": "Main HTML entry with meta tags, favicon, root mount, and module script loader for the React app.",
  "frontend/src/App.tsx": "Sets up hash-based routing with site layout and routes for home, about, services, contact, and jobs pages.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form with validation, backend submission hooks, success/error states, and conditional UI.",
  "frontend/src/components/contact/MapEmbedPlaceholder.tsx": "Renders an iframe map embed using the cafe's configured map URL.",
  "frontend/src/components/contact/WhatsAppButton.tsx": "Button linking to WhatsApp chat using the cafe's configured number.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with headline, CTAs, and an illustration promoting digital services.",
  "frontend/src/components/home/ServicesPreviewSection.tsx": "Preview grid of service categories showing a few items each with a link to the full services page.",
  "frontend/src/components/home/WhyChooseUsSection.tsx": "Renders a feature grid highlighting service advantages with icons and descriptions.",
  "frontend/src/components/jobs/JobCard.tsx": "Displays job details with badges, metadata, and an apply button with official link validation.",
  "frontend/src/components/jobs/JobCardSkeleton.tsx": "Provides a skeleton placeholder UI for loading job cards.",
  "frontend/src/components/services/ServiceCategoryGrid.tsx": "Generates a grid of service categories and their items using data from servicesData.",
  "frontend/src/components/site/Container.tsx": "Wrapper component that applies consistent responsive container styling.",
  "frontend/src/components/site/SiteFooter.tsx": "Renders footer with cafe info, quick links, contact details, and social media icons.",
  "frontend/src/components/site/SiteHeader.tsx": "Creates a responsive header with navigation links, a logo, and mobile menu support.",
  "frontend/src/components/site/SiteLayout.tsx": "Defines the main site layout including header, routed content, and footer.",
  "frontend/src/config/cafeInfo.ts": "Stores static cafe information such as name, contact details, and map embed URL.",
  "frontend/src/config/socialLinks.ts": "Provides social media links, including a WhatsApp link generated from cafe info.",
  "frontend/src/content/services.ts": "Defines service categories and items used to populate the services grid.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor based on user identity with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login state and stored identity handling.",
  "frontend/src/hooks/useJobs.ts": "React Query hook that fetches government jobs via fetchGovernmentJobs with caching, retries, and loading/error states.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching cafe info, submitting contact forms, checking contact status, and retrieving all contacts through an actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes with typography and accessibility adjustments.",
  "frontend/src/lib/jobs/govJobModel.ts": "Defines the GovernmentJob interface representing normalized government job data for UI use.",
  "frontend/src/lib/jobs/govJobsClient.ts": "Simulates fetching government job listings by returning a delayed static dataset of normalized job entries.",
  "frontend/src/lib/jobs/jobFiltering.ts": "Provides pure functions to filter jobs by keyword or category and extract predefined categories.",
  "frontend/src/lib/jobs/officialDomains.ts": "Defines an allowlist of official government domains and utilities to validate job apply URLs.",
  "frontend/src/lib/jobs/remotiveClient.ts": "Empty placeholder module for future Remotive job fetching logic.",
  "frontend/src/main.tsx": "Sets up the React app root with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata, mission/vision sections, and styled informational content about the cafe.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with SEO metadata, cafe contact details, business hours, a contact form, WhatsApp button, and a map placeholder.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with SEO metadata, hero and services preview sections, a CTA area, and WhatsApp/contact links.",
  "frontend/src/pages/JobsPage.tsx": "Implements the government jobs listing page with search, category filtering, pagination, error handling, and SEO metadata.",
  "frontend/src/pages/ServicesPage.tsx": "Displays the services overview page with SEO metadata, a services grid, and a custom-service inquiry section.",
  "frontend/src/seo/Seo.tsx": "Manages dynamic page titles and meta tags, including Open Graph, Twitter cards, and LocalBusiness JSON-LD.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project configuration, requirements, features, and architectural notes for the government jobs site build."
}