{
  "backend/main.mo": "Motoko canister storing contacts keyed by caller principal, with submit, lookup, and listing plus static cafe info.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Plain text listing of frontend file summaries for build planning.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "HTML entry file setting title, meta description, favicon, and root mount point.",
  "frontend/src/App.tsx": "React router setup using hash history with routes for home, about, services, and contact pages.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form with validation, backend submission, and success state when message already submitted.",
  "frontend/src/components/contact/MapEmbedPlaceholder.tsx": "Iframe wrapper showing the configured Google Maps embed URL.",
  "frontend/src/components/contact/WhatsAppButton.tsx": "Styled WhatsApp button linking to wa.me using configured number.",
  "frontend/src/components/home/GallerySection.tsx": "Gallery grid of static images with dialog-based zoom view.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with new heading, subheading, service CTA, and WhatsApp contact CTA plus illustration.",
  "frontend/src/components/home/ServicesPreviewSection.tsx": "Renders a homepage section showing three service previews with icons, descriptions, and a link to the full services page.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Displays a grid of client testimonials with star ratings, quoted text, and user details.",
  "frontend/src/components/home/WhyChooseUsSection.tsx": "Shows a list of features explaining why customers should choose the service, each with an icon and description.",
  "frontend/src/components/jobs/JobCard.tsx": "Empty placeholder file for a job card component.",
  "frontend/src/components/jobs/JobCardSkeleton.tsx": "Empty placeholder file for a job card skeleton component.",
  "frontend/src/components/services/ServiceCategoryGrid.tsx": "Renders service categories and items in grids with icons, descriptions, prices, and a WhatsApp order button.",
  "frontend/src/components/site/Container.tsx": "Provides a responsive layout wrapper that adds consistent horizontal padding.",
  "frontend/src/components/site/FloatingWhatsAppButton.tsx": "Shows a fixed WhatsApp floating button linking to the cafe’s WhatsApp number.",
  "frontend/src/components/site/SiteFooter.tsx": "Renders the footer with about info, quick links, contact details, and social media icons.",
  "frontend/src/components/site/SiteHeader.tsx": "Displays the site header with logo, navigation links, WhatsApp button, and a mobile menu toggle.",
  "frontend/src/components/site/SiteLayout.tsx": "Defines the main layout including header, routed content area, footer, and floating WhatsApp button.",
  "frontend/src/config/cafeInfo.ts": "Stores basic cafe details such as name, phone numbers, email, address, and map embed URL.",
  "frontend/src/config/socialLinks.ts": "Provides social media and WhatsApp URLs derived from cafe info.",
  "frontend/src/content/services.ts": "Defines service category and item interfaces and provides structured data for all offered services.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handlers, and initializes AuthClient with custom options.",
  "frontend/src/hooks/useJobs.ts": "Empty placeholder file for job-related hooks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching cafe info, contacts, submitted status, and submitting contact data via the actor.",
  "frontend/src/index.css": "TailwindCSS config defining light/dark theme variables, typography rules, and global styles.",
  "frontend/src/lib/jobs/govJobModel.ts": "Empty placeholder for government job model definitions.",
  "frontend/src/lib/jobs/govJobsClient.ts": "Empty placeholder for government jobs API client.",
  "frontend/src/lib/jobs/jobFiltering.ts": "Empty placeholder for job filtering utilities.",
  "frontend/src/lib/jobs/officialDomains.ts": "Empty placeholder for official domain list utilities.",
  "frontend/src/lib/jobs/remotiveClient.ts": "Empty placeholder for Remotive jobs API client.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and overview sections using reusable components.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, business hours, a contact form, and map placeholder for the cafe.",
  "frontend/src/pages/HomePage.tsx": "Home page combining hero, services preview, gallery, testimonials, and a CTA section.",
  "frontend/src/pages/JobsPage.tsx": "Empty placeholder for the jobs listing page.",
  "frontend/src/pages/ServicesPage.tsx": "Shows service categories and offers a CTA for custom service inquiries.",
  "frontend/src/seo/Seo.tsx": "React component that sets document title, meta tags, Open Graph/Twitter tags, and injects LocalBusiness JSON-LD based on provided SEO props.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, shadows, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project state file describing the website’s purpose, architecture, image requirements, and existing implemented features."
}