{
  "backend/main.mo": "Actor stores contact submissions keyed by caller principal, provides queries for contact status, retrieval, and cafe info.",
  "feature_evidence.json": "Feature evidence report mapping high‑level feature definitions to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and functionality of frontend files including components, pages, hooks, and configs.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, theming tokens, and dark mode overrides.",
  "frontend/index.html": "Main HTML entry with favicon, SEO meta tags, root div, and script bootstrapping the React app.",
  "frontend/src/App.tsx": "Configures hash‑based routing with TanStack Router and registers Home, About, Services, and Contact pages.",
  "frontend/src/components/contact/ContactForm.tsx": "Form component handling contact submission with validation, backend mutation, and success/error UI states.",
  "frontend/src/components/contact/MapEmbedPlaceholder.tsx": "Embeds a Google Maps iframe using the configured cafe map URL inside a styled card container.",
  "frontend/src/components/contact/WhatsAppButton.tsx": "Button linking to WhatsApp chat using the cafe's configured number with green branded styling.",
  "frontend/src/components/home/HeroSection.tsx": "Hero banner with headline, subheading, CTAs, and an illustrated image section using gradient backgrounds.",
  "frontend/src/components/home/ServicesPreviewSection.tsx": "Preview grid showing service categories with a short list of items and link to full Services page.",
  "frontend/src/components/home/WhyChooseUsSection.tsx": "Displays a grid of service features with icons and descriptions inside a styled section.",
  "frontend/src/components/services/ServiceCategoryGrid.tsx": "Renders service categories from servicesData, showing category icons, titles, and item lists.",
  "frontend/src/components/site/Container.tsx": "Provides a responsive centered container wrapper for layout spacing.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with cafe info, quick links, contact details, and social media icons.",
  "frontend/src/components/site/SiteHeader.tsx": "Sticky header with navigation links, logo, WhatsApp button, and mobile menu toggle.",
  "frontend/src/components/site/SiteLayout.tsx": "Wraps the site with header, footer, and an outlet for routed content.",
  "frontend/src/config/cafeInfo.ts": "Exports static cafe information including contact details and map embed URL.",
  "frontend/src/config/socialLinks.ts": "Defines social media and WhatsApp link URLs.",
  "frontend/src/content/services.ts": "Provides service categories and items used for the services grid.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching cafe info, contacts, and submitting contact forms via the actor.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables and theme styles for light/dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata, descriptive sections about the cafe, mission/vision blocks, and reasons to choose the service.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, business hours, a contact form area, WhatsApp button, and SEO metadata for the Contact page.",
  "frontend/src/pages/HomePage.tsx": "Builds the Home page with hero, services preview, why-choose-us sections, SEO setup, and a CTA area with WhatsApp and contact links.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with SEO metadata, a service category grid, and a custom services CTA block.",
  "frontend/src/seo/Seo.tsx": "A React component that sets page titles, meta tags, Open Graph/Twitter tags, and injects LocalBusiness JSON-LD.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, requirements, design goals, image assets, and existing implemented features for the site build."
}