{
  "kind": "build_request",
  "title": "Rebrand Nath Cyber Cafe site for Graphic Design, School Projects, and College Assignments + add Gallery, Testimonials, and WhatsApp ordering",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Home page hero section to match the new business focus and exact hero copy: Headline “Professional Graphic Design & Academic Project Solutions”; Subheading “Creative Designs & Neat Academic Work at Affordable Prices”; primary CTA “View Services” (links to /services); secondary CTA “Contact Now” that opens WhatsApp chat using the configured WhatsApp number.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Headline: “Professional Graphic Design & Academic Project Solutions”\nSubheading:\nCreative Designs & Neat Academic Work at Affordable Prices\nButtons:\nView Services\nContact Now (WhatsApp integration)"
        ]
      },
      "acceptanceCriteria": [
        "Home page hero headline and subheading match the user-provided text exactly (including punctuation/case).",
        "“View Services” navigates to #/services.",
        "“Contact Now” opens https://wa.me/91<configured_number> in a new tab with rel=\"noopener noreferrer\"."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the current Services content model and UI to support service cards with: icon, service name, short description, optional starting price placeholder, and an “Order Now” button that opens WhatsApp with a prefilled message containing the selected service name. Implement this for three service sections: (1) Graphic Design Services with the 8 requested items; (2) School Project Services with the 6 requested items and the provided section description; (3) College Assignment Services with the 6 requested items and the provided section description.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "🎨 Graphic Design Services Section\nCreate a visually appealing card layout including:\nLogo Design\nResume / CV Design\nVisiting Card Design\nBanner & Poster Design\nInvitation Card Design\nSocial Media Post Design\nPassport Size Photo Editing\nFlex & Print Design\nEach service should have:\nShort description\nStarting price (optional placeholder)\n“Order Now” button\n\n📚 School Project Services Section\nInclude:\nAll Class School Project Files\nSubject-wise Project Work\nPractical File Preparation\nChart & Model Guidance\nDecorative Cover Page Design\nPrinted & Handwritten Project Options\nAdd a short description:\n“Neat, well-structured and teacher-approved project files.”\n\n🎓 College Assignment Services Section\nInclude:\nCollege Assignments (All Streams)\nPractical Files\nPPT Presentation Design\nResearch Formatting\nTyping & Formatting Work\nCover Page & Spiral Binding Support\nAdd a professional description:\n“Proper formatting, plagiarism-free structured assignments.”"
        ]
      },
      "acceptanceCriteria": [
        "Services page renders exactly three sections: Graphic Design Services, School Project Services, and College Assignment Services.",
        "Each service item displays: an icon, the service name, a short description, a visible starting price placeholder (e.g., “Starting from ₹___”), and an “Order Now” button.",
        "Clicking “Order Now” opens WhatsApp chat (wa.me) with a prefilled text that includes the selected service name.",
        "The School Project Services section displays the description “Neat, well-structured and teacher-approved project files.”",
        "The College Assignment Services section displays the description “Proper formatting, plagiarism-free structured assignments.”"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Home page to include: (a) a Services section that highlights the three main service areas (Graphic Design, School Projects, College Assignments) with attractive icon cards and a link to the full Services page; (b) a new Gallery section that shows a responsive grid of previous-work images (static assets) with a simple “view larger” interaction; (c) a new Testimonials section displaying at least 3 testimonials (static content) in a professional card layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Gallery section to showcase previous work\nTestimonials section"
        ]
      },
      "acceptanceCriteria": [
        "Home page contains a Gallery section with a grid of images that adapts from mobile to desktop.",
        "Gallery images are loaded from frontend/public/assets/generated (no backend fetching).",
        "Home page contains a Testimonials section with at least 3 entries (name + short testimonial text).",
        "All new sections are responsive and match the site theme."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a persistent floating WhatsApp button visible across the entire site (all routes), fixed to the bottom-right corner, linking to WhatsApp chat using the configured WhatsApp number.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "WhatsApp floating button"
        ]
      },
      "acceptanceCriteria": [
        "A floating WhatsApp button is visible on Home, Services, About (if present), and Contact pages.",
        "Button uses the configured WhatsApp number and opens wa.me in a new tab with rel=\"noopener noreferrer\".",
        "Button does not obstruct primary page actions on mobile (reasonable spacing from edges)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update site navigation and footer “Quick Links” to match the new site focus by removing the Government Jobs link from the header and footer navigation (the site should prioritize Home, About, Services, Contact).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Create a modern, professional and responsive website ... focusing mainly on Graphic Design Services, School Projects, and College Assignments."
        ]
      },
      "acceptanceCriteria": [
        "Header navigation no longer shows a “Jobs” link.",
        "Footer Quick Links no longer shows “Government Jobs” (or “Jobs”).",
        "All remaining nav links work and route correctly."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Update SEO metadata and structured data defaults to reflect the new service focus (graphic design + school projects + college assignments) instead of government jobs/general online services. Ensure each main page (Home, Services, Contact) has an appropriate title and description aligned with the new content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "SEO optimized structure"
        ]
      },
      "acceptanceCriteria": [
        "Default SEO description mentions graphic design, school projects, and college assignments (not government jobs).",
        "Home/Services/Contact pages render distinct, relevant titles and descriptions.",
        "LocalBusiness JSON-LD remains present and valid JSON."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Ensure contact details match the user request on the Contact section/page: business name “Nath Cyber Cafe”, phone number “9435212145 / 9126026463”, and WhatsApp integration. Keep the contact form fields as Name, Phone, Message, and keep the Google Map location placeholder section.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "📞 Contact Section\nBusiness Name: Nath Cyber Cafe\nPhone Number: 9435212145 / 9126026463\nWhatsApp Button\nContact Form (Name, Phone, Message)\nGoogle Map Location Placeholder"
        ]
      },
      "acceptanceCriteria": [
        "Frontend contact page shows the business name and the phone string exactly as provided.",
        "WhatsApp links use the configured WhatsApp number consistently across frontend config and backend cafe info response.",
        "Contact form has fields: Name, Phone, Message and can submit successfully to the existing backend contact submission method.",
        "Map placeholder/iframe section remains present on the Contact page."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Maintain a clean, minimalist, professional royal blue + cyan + white visual theme across all updated/new sections, using modern sans-serif typography and consistent spacing, ensuring the full site remains mobile-first responsive and fast-loading (avoid heavy assets/scripts).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Clean, minimalist and professional layout\nRoyal blue, cyan and white color theme\nModern sans-serif fonts\nMobile-friendly responsive design\nFast loading\nSmooth scrolling and modern UI"
        ]
      },
      "acceptanceCriteria": [
        "New/updated sections visually match the existing Tailwind theme variables and use a consistent typography scale.",
        "Pages remain responsive at common breakpoints (mobile, tablet, desktop).",
        "No new heavy libraries are introduced for gallery/testimonials; gallery behavior is implemented with lightweight UI logic.",
        "Smooth scrolling remains enabled (no regression)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add social media links area (icons/links) in the footer and ensure they are present and styled consistently. Keep WhatsApp as a working link; leave other social links as placeholders if no real URLs are provided.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Social media links"
        ]
      },
      "acceptanceCriteria": [
        "Footer renders social icons/links including WhatsApp and YouTube (existing), and placeholder links remain safe (#) without breaking navigation.",
        "WhatsApp social link opens the configured wa.me URL."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Update backend cafe info response to return a WhatsApp number consistent with the frontend configuration (use 9126026463) so any frontend usage of backend cafe info cannot display a mismatched WhatsApp number.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "WhatsApp integration"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo getCafeInfo().whatsapp returns \"9126026463\".",
        "Frontend WhatsApp buttons/links use 9126026463 consistently."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Render any newly generated images as static assets under frontend/public/assets/generated and use them in the Gallery section (and any updated branding/hero illustration if applicable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Gallery section to showcase previous work"
        ]
      },
      "acceptanceCriteria": [
        "New images exist under frontend/public/assets/generated and are referenced by <img> tags in the Gallery section.",
        "No backend endpoints are used to serve images."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not modify frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if state schema changes (not expected for this request)."
  ],
  "nonGoals": [
    "Do not implement third-party authentication beyond Internet Identity.",
    "Do not add external databases or non-IC backend services.",
    "Do not implement real-time chat or WebSocket features.",
    "Do not build an admin dashboard/CMS for gallery/testimonials (use static content/assets for now)."
  ],
  "imageRequirements": {
    "required": [
      "Minimal modern logomark for a digital service business, royal blue and cyan on white background (nath-logo-mark.dim_512x512.png)",
      "Wide gallery image showing a clean logo/branding mockup on stationery (gallery-01.dim_1200x900.png)",
      "Wide gallery image showing a modern poster/banner design mockup (gallery-02.dim_1200x900.png)",
      "Wide gallery image showing an academic project/assignment cover page design mockup (gallery-03.dim_1200x900.png)"
    ],
    "edits": [
      "Update the illustration to depict graphic design and academic work in a clean minimalist style, matching royal blue/cyan/white palette (hero-illustration.dim_1200x800.png > hero-illustration-v2.dim_1200x800.png)",
      "Refine the existing logo to match the new minimalist royal blue/cyan identity (logo.dim_512x512.png > logo-v2.dim_512x512.png)",
      "Refine the header logo to match the updated branding (header-logo.dim_512x512.png > header-logo-v2.dim_512x512.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}