{
  "kind": "build_request",
  "title": "Convert Jobs page to “Latest Government Jobs” with official apply links, filters, and royal-blue government styling",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the existing /jobs route page to be a “Latest Government Jobs” page for Nath Cyber Cafe, with user-facing copy focused on Indian government job vacancies (not general/remote jobs).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create a professional and responsive “Latest Government Jobs” page for a website named Nath Cyber Cafe. The page should display updated Indian government job vacancies with official apply links."
        ]
      },
      "acceptanceCriteria": [
        "Visiting /jobs shows page title/hero text referencing “Latest Government Jobs” and “Nath Cyber Cafe”.",
        "The old Remotive/remote-jobs wording is removed from the Jobs page SEO description and visible UI copy."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a government-jobs data source and replace the current Remotive jobs integration so the Jobs page fetches and displays Indian government job vacancies from trusted sources (RSS feeds or public APIs where available), normalized into a single job list.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Fetch latest government jobs from trusted official sources (RSS feeds or public APIs if available)."
        ]
      },
      "acceptanceCriteria": [
        "The Jobs page no longer calls the Remotive API for its primary job list.",
        "The app fetches government job items from at least one feed/API source and renders them in the UI.",
        "The fetched job items are normalized into a consistent model used by the UI, even if some fields are missing from the source (missing fields render as “—” rather than breaking the UI).",
        "Data fetching uses caching/refresh behavior so repeated visits do not refetch excessively (e.g., React Query staleTime or backend caching)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure each job card displays the required government-job fields and provides a prominent “Apply Now” button that opens the official notification/application link in a new tab with secure external linking.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Display for each job: Job Title, Organization Name, Total Vacancies, Qualification, Last Date, Location, Official Apply Link",
          "Bold “Apply Now” button",
          "Secure external linking (target=\"_blank\")"
        ]
      },
      "acceptanceCriteria": [
        "Each rendered job includes: Job Title, Organization Name, Total Vacancies, Qualification, Last Date, Location, and an Apply Now link.",
        "“Apply Now” opens in a new tab and uses rel=\"noopener noreferrer\".",
        "If a field is unknown/unavailable from the source, the UI shows a placeholder (e.g., “—”) and continues rendering cleanly."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add search and filtering specifically for government jobs: search must filter by job title OR qualification text; category filter options must include exactly: SSC, Railway, Banking, UPSC, State PSC; and the page must support the broader job types requested (Central Government Jobs, State Government Jobs, Railway Jobs, SSC Jobs, Banking Jobs, Defence Jobs, Teaching Jobs) via categories/tags.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add search bar (filter by job title or qualification).",
          "Add category filter: SSC, Railway, Banking, UPSC, State PSC",
          "The page should show: Central Government Jobs, State Government Jobs, Railway Jobs, SSC Jobs, Banking Jobs, Defence Jobs, Teaching Jobs"
        ]
      },
      "acceptanceCriteria": [
        "Typing in the search bar filters the visible job list by matching against title and qualification fields.",
        "Category dropdown includes SSC, Railway, Banking, UPSC, State PSC (plus an “All” option).",
        "Jobs are tagged/categorized so the user can browse the requested government job groupings (Central/State/Railway/SSC/Banking/Defence/Teaching) via visible labels and/or the category system."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Keep “Load More” pagination, add a visible “Last Updated” timestamp for the job data, and provide user-friendly error handling if the feed/API fails.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add “Load More” button.",
          "Show “Last Updated” date.",
          "If API fails, show user-friendly message."
        ]
      },
      "acceptanceCriteria": [
        "A “Load More” control incrementally reveals additional jobs without reloading the page.",
        "The Jobs page displays a “Last Updated” date/time derived from the latest successful fetch (backend response timestamp or client fetch time).",
        "If data fetching fails, the page shows a clear, non-technical error message and a retry action."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Enforce “official sources only” for apply links by validating/whitelisting official government organization domains before rendering/enabling “Apply Now”, including references such as UPSC, SSC, Railway Recruitment Board, IBPS, and SBI; block or clearly label any non-official links.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use official websites for job links such as: Union Public Service Commission, Staff Selection Commission, Railway Recruitment Board, Institute of Banking Personnel Selection, State Bank of India",
          "Only redirect users to official websites for applying."
        ]
      },
      "acceptanceCriteria": [
        "The system validates job apply URLs against an explicit allowlist of official domains (maintained in code/config).",
        "If a job item’s apply URL is not on the allowlist, the UI does not present it as a valid “Apply Now” link (e.g., disables the button or shows “Official link unavailable”).",
        "Allowed official links open in a new tab with rel=\"noopener noreferrer\"."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Update the Jobs page UI to a professional, trustworthy, government-style layout using a royal blue + white theme, with a header area that includes a government-style icon/emblem and card-based listings with a bold “Apply Now” button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Royal blue + white color theme",
          "Government-style clean layout",
          "Card-based job listing",
          "Government job icon or emblem in header"
        ]
      },
      "acceptanceCriteria": [
        "The Jobs page visually uses royal blue and white as the primary theme colors (buttons, accents, header elements).",
        "The page remains fully responsive on mobile/tablet/desktop.",
        "A government-style emblem/icon appears in the Jobs page header area.",
        "Job listings are presented as cards with a prominent, high-contrast “Apply Now” button."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add the requested footer content for this government jobs experience: show Nath Cyber Cafe contact details (including phone 9435212145), a WhatsApp chat button, and the disclaimer text exactly: “This website only provides information and official links. We are not a government organization.”",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add contact details: Nath Cyber Cafe Phone: 9435212145 WhatsApp Chat Button",
          "Add disclaimer: “This website only provides information and official links. We are not a government organization.”"
        ]
      },
      "acceptanceCriteria": [
        "The Jobs page (or site footer visible on the Jobs page) clearly displays Nath Cyber Cafe contact details and a working WhatsApp chat link/button.",
        "The disclaimer text is present verbatim and visible on the Jobs page.",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add/adjust SEO metadata for the government jobs page to reflect “Latest Government Jobs” and ensure fast-loading behavior (avoid heavy client processing), keeping code clean and well-commented around data mapping, filtering, and pagination.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "SEO optimized",
          "Fast loading",
          "Clean and commented code"
        ]
      },
      "acceptanceCriteria": [
        "/jobs SEO title and description mention government jobs and Nath Cyber Cafe.",
        "Filtering and pagination remain performant with typical feed sizes (no noticeable UI lag when searching/filtering).",
        "Key parsing/mapping/filtering logic is documented with concise comments."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add the generated government-style emblem image as a static asset under frontend/public/assets/generated and use it in the Jobs page header area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Government job icon or emblem in header"
        ]
      },
      "acceptanceCriteria": [
        "The emblem image exists in frontend/public/assets/generated with the filename specified in imageRequirements.required.",
        "The Jobs page header renders the emblem with appropriate alt text and responsive sizing."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only UI components must be composed, not modified).",
    "Do not edit the immutable auth/actor bootstrap hooks: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); add backend/migration.mo only if state schema changes require it."
  ],
  "nonGoals": [
    "Do not implement the optional advanced features in this request: email notification subscription, daily auto-update system, admin dashboard to manually add jobs, PDF notification download button.",
    "Do not add third-party authentication providers (only Internet Identity is supported).",
    "Do not add real-time features (WebSockets/chat/push notifications)."
  ],
  "imageRequirements": {
    "required": [
      "Government-style circular emblem icon with Ashoka-inspired silhouette and laurel wreath, flat vector look, royal blue on white (gov-emblem.dim_256x256.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}