{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Nath Cyber Cafe rebrand: services, gallery/testimonials, WhatsApp ordering, SEO, and navigation updates",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update Home hero copy and CTAs to reflect graphic design + academic services, including WhatsApp CTA behavior.",
      "acceptanceCriteria": [
        "Home page hero headline and subheading match the user-provided text exactly (including punctuation/case).",
        "“View Services” navigates to #/services.",
        "“Contact Now” opens https://wa.me/91<configured_number> in a new tab with rel=\"noopener noreferrer\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/home/HeroSection.tsx",
          "operation": "modify",
          "description": "Replace hero headline/subheading with the exact provided copy, update primary CTA to “View Services” linking to /services, and change secondary CTA to “Contact Now” opening the configured WhatsApp wa.me URL in a new tab with rel=\"noopener noreferrer\". Update hero image reference to frontend/public/assets/generated/hero-illustration-v2.dim_1200x800.png."
        },
        {
          "path": "frontend/public/assets/generated/hero-illustration-v2.dim_1200x800.png",
          "operation": "create",
          "description": "Add the generated updated hero illustration asset as a static file to be referenced by the Hero section."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Revamp Services data + UI to show service cards with icon, description, starting price placeholder, and WhatsApp “Order Now” with prefilled message for three required sections.",
      "acceptanceCriteria": [
        "Services page renders exactly three sections: Graphic Design Services, School Project Services, and College Assignment Services.",
        "Each service item displays: an icon, the service name, a short description, a visible starting price placeholder (e.g., “Starting from ₹___”), and an “Order Now” button.",
        "Clicking “Order Now” opens WhatsApp chat (wa.me) with a prefilled text that includes the selected service name.",
        "The School Project Services section displays the description “Neat, well-structured and teacher-approved project files.”",
        "The College Assignment Services section displays the description “Proper formatting, plagiarism-free structured assignments.”"
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/services.ts",
          "operation": "modify",
          "description": "Replace the services content model to define exactly three sections (Graphic Design Services, School Project Services, College Assignment Services) and, for each service item, include: icon, name, short description, and a starting price placeholder string (e.g., “Starting from ₹___”). Include all requested items per section and include the two required section descriptions for School Project Services and College Assignment Services."
        },
        {
          "path": "frontend/src/components/services/ServiceCategoryGrid.tsx",
          "operation": "modify",
          "description": "Update the Services page grid to render the new three-section model as card-based UI: each service card shows icon, name, short description, starting price placeholder, and an “Order Now” action that opens the configured WhatsApp wa.me URL with a prefilled message containing the selected service name. Ensure the two section descriptions render exactly as provided."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Update Services page copy (intro paragraph and SEO description prop) to align with the new focus (graphic design, school projects, college assignments) and remove references to government forms/jobs in the page messaging."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Expand Home page with a 3-area services highlight section, a static-asset Gallery with view-larger interaction, and a Testimonials section with at least 3 entries.",
      "acceptanceCriteria": [
        "Home page contains a Gallery section with a grid of images that adapts from mobile to desktop.",
        "Gallery images are loaded from frontend/public/assets/generated (no backend fetching).",
        "Home page contains a Testimonials section with at least 3 entries (name + short testimonial text).",
        "All new sections are responsive and match the site theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/home/ServicesPreviewSection.tsx",
          "operation": "modify",
          "description": "Replace the current services preview layout with an icon-card highlight for exactly the three main service areas (Graphic Design, School Projects, College Assignments) and provide a clear link/button to the full /services page."
        },
        {
          "path": "frontend/src/components/home/GallerySection.tsx",
          "operation": "create",
          "description": "Create a responsive Gallery section that renders a grid of static <img> assets from frontend/public/assets/generated (gallery-01.dim_1200x900.png, gallery-02.dim_1200x900.png, gallery-03.dim_1200x900.png) and supports a lightweight “view larger” interaction. Use the shadcn-ui Dialog component (from the existing read-only ui library) to implement the view-larger modal; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/home/TestimonialsSection.tsx",
          "operation": "create",
          "description": "Create a Testimonials section with a professional responsive card layout containing at least 3 static testimonials (name + short text), styled to match the royal blue/cyan/white theme."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Wire the updated ServicesPreviewSection plus the new GallerySection and TestimonialsSection into the Home page layout, ensuring mobile-first responsiveness and consistent spacing/typography."
        },
        {
          "path": "frontend/public/assets/generated/gallery-01.dim_1200x900.png",
          "operation": "create",
          "description": "Add generated gallery image asset #1 as a static file for use in the Home Gallery section."
        },
        {
          "path": "frontend/public/assets/generated/gallery-02.dim_1200x900.png",
          "operation": "create",
          "description": "Add generated gallery image asset #2 as a static file for use in the Home Gallery section."
        },
        {
          "path": "frontend/public/assets/generated/gallery-03.dim_1200x900.png",
          "operation": "create",
          "description": "Add generated gallery image asset #3 as a static file for use in the Home Gallery section."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a persistent floating WhatsApp button across all routes, fixed bottom-right, using the configured WhatsApp number.",
      "acceptanceCriteria": [
        "A floating WhatsApp button is visible on Home, Services, About (if present), and Contact pages.",
        "Button uses the configured WhatsApp number and opens wa.me in a new tab with rel=\"noopener noreferrer\".",
        "Button does not obstruct primary page actions on mobile (reasonable spacing from edges)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/site/FloatingWhatsAppButton.tsx",
          "operation": "create",
          "description": "Create a persistent floating WhatsApp action button (fixed bottom-right) that links to the configured wa.me URL in a new tab with rel=\"noopener noreferrer\", with mobile-safe spacing and accessible label."
        },
        {
          "path": "frontend/src/components/site/SiteLayout.tsx",
          "operation": "modify",
          "description": "Render the new FloatingWhatsAppButton within the global layout so it appears on all routes (Home, Services, About, Contact, and any other existing routes)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update header navigation and footer quick links to remove Government Jobs/Jobs, prioritizing Home, About, Services, Contact.",
      "acceptanceCriteria": [
        "Header navigation no longer shows a “Jobs” link.",
        "Footer Quick Links no longer shows “Government Jobs” (or “Jobs”).",
        "All remaining nav links work and route correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/site/SiteHeader.tsx",
          "operation": "modify",
          "description": "Remove the Jobs link from the header navigation (desktop and mobile menus), leaving Home, About, Services, Contact as the primary routes."
        },
        {
          "path": "frontend/src/components/site/SiteFooter.tsx",
          "operation": "modify",
          "description": "Remove the Government Jobs/Jobs entry from the footer Quick Links and ensure remaining links (Home, About, Services, Contact) route correctly."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Refresh SEO defaults and per-page metadata (Home/Services/Contact) to match the new business focus, keeping valid LocalBusiness JSON-LD.",
      "acceptanceCriteria": [
        "Default SEO description mentions graphic design, school projects, and college assignments (not government jobs).",
        "Home/Services/Contact pages render distinct, relevant titles and descriptions.",
        "LocalBusiness JSON-LD remains present and valid JSON."
      ],
      "file_operations": [
        {
          "path": "frontend/src/seo/Seo.tsx",
          "operation": "modify",
          "description": "Update the default SEO description to emphasize graphic design, school projects, and college assignments (and remove government jobs focus). Keep LocalBusiness JSON-LD present and valid JSON, aligned with the updated description."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the Home page <Seo> title/description props to reflect the new focus (graphic design + academic project solutions) and match the updated hero/services content."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Update the Services page <Seo> title/description props to reflect the three service areas and remove government forms/jobs emphasis."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update the Contact page <Seo> title/description props to reflect the rebranded services and consistent contact messaging."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the base HTML title/meta description to match the new service focus (graphic design, school projects, college assignments) and remove government jobs emphasis."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Ensure Contact page details (name/phones) match exactly, keep WhatsApp integration consistent, preserve form fields and map placeholder.",
      "acceptanceCriteria": [
        "Frontend contact page shows the business name and the phone string exactly as provided.",
        "WhatsApp links use the configured WhatsApp number consistently across frontend config and backend cafe info response.",
        "Contact form has fields: Name, Phone, Message and can submit successfully to the existing backend contact submission method.",
        "Map placeholder/iframe section remains present on the Contact page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/cafeInfo.ts",
          "operation": "modify",
          "description": "Verify and (if needed) set cafe name to “Nath Cyber Cafe”, phone string to “9435212145 / 9126026463”, and WhatsApp number to “9126026463” to ensure consistent WhatsApp link generation across the UI."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Ensure the Contact page visibly renders the business name and phone string exactly as provided, continues to show the WhatsApp quick contact button, preserves the contact form field set (Name, Phone, Message), and keeps the Google Map placeholder section present."
        },
        {
          "path": "frontend/src/components/contact/ContactForm.tsx",
          "operation": "modify",
          "description": "Confirm the contact form fields remain exactly Name, Phone, Message and that submission continues to use the existing contact submission hook without introducing new fields or flows."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Maintain a clean minimalist royal blue + cyan + white theme with consistent typography, responsive layout, smooth scrolling, and fast loading.",
      "acceptanceCriteria": [
        "New/updated sections visually match the existing Tailwind theme variables and use a consistent typography scale.",
        "Pages remain responsive at common breakpoints (mobile, tablet, desktop).",
        "No new heavy libraries are introduced for gallery/testimonials; gallery behavior is implemented with lightweight UI logic.",
        "Smooth scrolling remains enabled (no regression)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/home/GallerySection.tsx",
          "operation": "modify",
          "description": "Ensure Gallery section styling uses existing Tailwind theme tokens (royal blue/cyan/white), remains responsive, and keeps the view-larger interaction lightweight (no new heavy libraries). If using shadcn-ui Dialog, verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/home/TestimonialsSection.tsx",
          "operation": "modify",
          "description": "Ensure Testimonials section uses the existing typography scale and spacing conventions, is mobile-first responsive, and matches the established theme colors."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If needed, make minimal adjustments to global typography/spacing utilities to keep consistency across new sections while preserving smooth scrolling behavior (no regressions to html scroll-behavior)."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add/ensure footer social media icons/links area with working WhatsApp link and safe placeholders for unknown URLs.",
      "acceptanceCriteria": [
        "Footer renders social icons/links including WhatsApp and YouTube (existing), and placeholder links remain safe (#) without breaking navigation.",
        "WhatsApp social link opens the configured wa.me URL."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/socialLinks.ts",
          "operation": "modify",
          "description": "Ensure the WhatsApp social link is generated from the configured WhatsApp number and that other socials remain safe placeholders (#) when not provided, while keeping YouTube as the existing real URL."
        },
        {
          "path": "frontend/src/components/site/SiteFooter.tsx",
          "operation": "modify",
          "description": "Ensure the footer renders a clearly styled social links area (icons/links) with a working WhatsApp link (configured wa.me) and other placeholder links that do not break navigation."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Place newly generated images under frontend/public/assets/generated and wire them into the Gallery and updated branding/hero usage.",
      "acceptanceCriteria": [
        "New images exist under frontend/public/assets/generated and are referenced by <img> tags in the Gallery section.",
        "No backend endpoints are used to serve images."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/nath-logo-mark.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated minimal modern logomark asset as a static file under frontend/public/assets/generated."
        },
        {
          "path": "frontend/public/assets/generated/logo-v2.dim_512x512.png",
          "operation": "create",
          "description": "Add the refined logo asset (v2) as a static file under frontend/public/assets/generated for footer/branding usage."
        },
        {
          "path": "frontend/public/assets/generated/header-logo-v2.dim_512x512.png",
          "operation": "create",
          "description": "Add the refined header logo asset (v2) as a static file under frontend/public/assets/generated for header usage."
        },
        {
          "path": "frontend/src/components/site/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update the header logo <img> reference to use frontend/public/assets/generated/header-logo-v2.dim_512x512.png."
        },
        {
          "path": "frontend/src/components/site/SiteFooter.tsx",
          "operation": "modify",
          "description": "Update the footer logo <img> reference to use frontend/public/assets/generated/logo-v2.dim_512x512.png and ensure branding text matches the new focus."
        },
        {
          "path": "frontend/src/components/home/GallerySection.tsx",
          "operation": "modify",
          "description": "Reference the gallery images by their exact static paths (frontend/public/assets/generated/gallery-01.dim_1200x900.png, gallery-02.dim_1200x900.png, gallery-03.dim_1200x900.png) via <img> tags; no backend fetching. If using shadcn-ui Dialog for view-larger, verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/home/HeroSection.tsx",
          "operation": "modify",
          "description": "Ensure hero illustration is referenced by its exact static path frontend/public/assets/generated/hero-illustration-v2.dim_1200x800.png and that no backend image loading is introduced."
        }
      ]
    }
  ]
}