{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Latest Government Jobs page for Nath Cyber Cafe (official links, filters, royal-blue styling)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Refocus the existing /jobs page content and copy to “Latest Government Jobs” for Nath Cyber Cafe (Indian government vacancies only).",
      "acceptanceCriteria": [
        "Visiting /jobs shows page title/hero text referencing “Latest Government Jobs” and “Nath Cyber Cafe”.",
        "The old Remotive/remote-jobs wording is removed from the Jobs page SEO description and visible UI copy."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/JobsPage.tsx",
          "operation": "modify",
          "description": "Update hero/title/body copy to “Latest Government Jobs” for Nath Cyber Cafe and remove all remote/Remotive wording; ensure user-facing English copy is government-jobs focused."
        },
        {
          "path": "frontend/src/hooks/useJobs.ts",
          "operation": "modify",
          "description": "Rename query intent away from Remotive in queryKey and comments so the app’s jobs fetching is clearly government-jobs focused (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace Remotive integration with a government-jobs data source (RSS/public sources) and normalize items into a consistent UI model with caching.",
      "acceptanceCriteria": [
        "The Jobs page no longer calls the Remotive API for its primary job list.",
        "The app fetches government job items from at least one feed/API source and renders them in the UI.",
        "The fetched job items are normalized into a consistent model used by the UI, even if some fields are missing from the source (missing fields render as “—” rather than breaking the UI).",
        "Data fetching uses caching/refresh behavior so repeated visits do not refetch excessively (e.g., React Query staleTime or backend caching)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/jobs/govJobsClient.ts",
          "operation": "create",
          "description": "Implement a lightweight government-jobs fetcher that loads items from at least one trusted public feed/source (e.g., RSS) and returns a normalized list plus a last-updated timestamp; keep parsing/mapping robust for missing fields and document mapping assumptions with concise comments."
        },
        {
          "path": "frontend/src/lib/jobs/govJobModel.ts",
          "operation": "create",
          "description": "Define an app-level GovernmentJob model used by the UI (title, organization, vacancies, qualification, lastDate, location, applyUrl, categories/tags, source); ensure optional fields are explicitly optional so the UI can render placeholders."
        },
        {
          "path": "frontend/src/hooks/useJobs.ts",
          "operation": "modify",
          "description": "Replace Remotive queryFn with govJobsClient fetching; keep React Query caching (staleTime) and retry behavior; return both normalized jobs and lastUpdated data for the Jobs page (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/pages/JobsPage.tsx",
          "operation": "modify",
          "description": "Wire the updated useJobs hook so /jobs renders the normalized government jobs list and uses returned lastUpdated data; ensure UI does not depend on Remotive fields."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update job cards to display required government-job fields with placeholders and a secure external “Apply Now” action.",
      "acceptanceCriteria": [
        "Each rendered job includes: Job Title, Organization Name, Total Vacancies, Qualification, Last Date, Location, and an Apply Now link.",
        "“Apply Now” opens in a new tab and uses rel=\"noopener noreferrer\".",
        "If a field is unknown/unavailable from the source, the UI shows a placeholder (e.g., “—”) and continues rendering cleanly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/jobs/JobCard.tsx",
          "operation": "modify",
          "description": "Refactor job card UI to render the required government-job fields (title, organization, vacancies, qualification, last date, location) with “—” placeholders; keep a prominent “Apply Now” button using target=\"_blank\" and rel=\"noopener noreferrer\" (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/jobs/JobCardSkeleton.tsx",
          "operation": "modify",
          "description": "Adjust skeleton layout to roughly match the updated government-job card field layout so loading state remains visually consistent (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add government-jobs search (title OR qualification) and category filtering with exact options, plus visible tags/groupings for requested job types.",
      "acceptanceCriteria": [
        "Typing in the search bar filters the visible job list by matching against title and qualification fields.",
        "Category dropdown includes SSC, Railway, Banking, UPSC, State PSC (plus an “All” option).",
        "Jobs are tagged/categorized so the user can browse the requested government job groupings (Central/State/Railway/SSC/Banking/Defence/Teaching) via visible labels and/or the category system."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/jobs/jobFiltering.ts",
          "operation": "modify",
          "description": "Update filtering utilities to operate on the new GovernmentJob model; implement keyword search that matches against job title OR qualification text; implement category filtering that supports the fixed category set and job tags/groupings; add concise comments explaining filter order and performance considerations."
        },
        {
          "path": "frontend/src/pages/JobsPage.tsx",
          "operation": "modify",
          "description": "Update the search placeholder and wiring so search filters by title/qualification; replace dynamic category extraction with the fixed dropdown options: All, SSC, Railway, Banking, UPSC, State PSC; display visible labels/badges for broader groupings (Central/State/Railway/SSC/Banking/Defence/Teaching) per job in the listing UI."
        },
        {
          "path": "frontend/src/components/jobs/JobCard.tsx",
          "operation": "modify",
          "description": "Render job category and broader grouping tags as visible badges/labels on each card (e.g., Central/State/Defence/Teaching) while keeping the official apply action prominent (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Keep Load More pagination, show a “Last Updated” timestamp, and provide user-friendly error handling with retry.",
      "acceptanceCriteria": [
        "A “Load More” control incrementally reveals additional jobs without reloading the page.",
        "The Jobs page displays a “Last Updated” date/time derived from the latest successful fetch (backend response timestamp or client fetch time).",
        "If data fetching fails, the page shows a clear, non-technical error message and a retry action."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useJobs.ts",
          "operation": "modify",
          "description": "Expose lastUpdated from the latest successful fetch (e.g., from React Query data) so the Jobs page can display it; ensure caching remains enabled to avoid excessive refetching on repeated visits."
        },
        {
          "path": "frontend/src/pages/JobsPage.tsx",
          "operation": "modify",
          "description": "Keep existing Load More behavior; add a visible “Last Updated” line near the results header using the hook’s lastUpdated; keep/adjust error state copy to be non-technical and include a retry action using refetch (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Enforce official-source-only apply links via an allowlist of official domains; disable/label non-official apply actions.",
      "acceptanceCriteria": [
        "The system validates job apply URLs against an explicit allowlist of official domains (maintained in code/config).",
        "If a job item’s apply URL is not on the allowlist, the UI does not present it as a valid “Apply Now” link (e.g., disables the button or shows “Official link unavailable”).",
        "Allowed official links open in a new tab with rel=\"noopener noreferrer\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/jobs/officialDomains.ts",
          "operation": "create",
          "description": "Add an explicit allowlist of official domains (e.g., upsc.gov.in, ssc.nic.in, indianrailways.gov.in/rrb*, ibps.in, sbi.co.in and other official government domains as needed) and a helper to validate apply URLs against it; document the allowlist intent and maintenance guidance with concise comments."
        },
        {
          "path": "frontend/src/components/jobs/JobCard.tsx",
          "operation": "modify",
          "description": "Validate each job’s applyUrl using the official domain allowlist; if not allowed, disable the “Apply Now” button and show a clear label such as “Official link unavailable”; if allowed, keep secure external linking with target=\"_blank\" and rel=\"noopener noreferrer\" (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/lib/jobs/govJobsClient.ts",
          "operation": "modify",
          "description": "When mapping source items, preserve the raw applyUrl and avoid inventing links; rely on the official domain allowlist in UI logic (and/or mapping metadata) so non-official links are clearly handled."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Restyle the Jobs page into a professional government-style layout with royal blue + white theme, header emblem, and card-based listings.",
      "acceptanceCriteria": [
        "The Jobs page visually uses royal blue and white as the primary theme colors (buttons, accents, header elements).",
        "The page remains fully responsive on mobile/tablet/desktop.",
        "A government-style emblem/icon appears in the Jobs page header area.",
        "Job listings are presented as cards with a prominent, high-contrast “Apply Now” button."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/JobsPage.tsx",
          "operation": "modify",
          "description": "Implement a government-style header/hero section with royal-blue accents and the emblem image; ensure responsive layout; keep card grid; adjust buttons and section styling to reinforce royal blue + white theme without modifying any read-only ui components (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If needed, fine-tune existing CSS variables (primary/ring/muted) to ensure a consistent royal-blue + white appearance while preserving accessibility contrast; do not introduce new global stylesheet paths."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add Jobs experience footer content: contact details (phone 9435212145), WhatsApp button, and required disclaimer text (verbatim).",
      "acceptanceCriteria": [
        "The Jobs page (or site footer visible on the Jobs page) clearly displays Nath Cyber Cafe contact details and a working WhatsApp chat link/button.",
        "The disclaimer text is present verbatim and visible on the Jobs page.",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/JobsPage.tsx",
          "operation": "modify",
          "description": "Add a Jobs-page footer/disclaimer section that includes phone 9435212145, a WhatsApp chat button (reuse existing WhatsAppButton), and the disclaimer text exactly: “This website only provides information and official links. We are not a government organization.” (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/site/SiteFooter.tsx",
          "operation": "modify",
          "description": "Ensure the global footer contact section continues to show Nath Cyber Cafe contact details and WhatsApp linking; if necessary, adjust copy so it remains consistent with the government jobs experience without removing existing site-wide content (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Update SEO metadata for /jobs and keep the page fast (efficient filtering/pagination, clean commented mapping code).",
      "acceptanceCriteria": [
        "/jobs SEO title and description mention government jobs and Nath Cyber Cafe.",
        "Filtering and pagination remain performant with typical feed sizes (no noticeable UI lag when searching/filtering).",
        "Key parsing/mapping/filtering logic is documented with concise comments."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/JobsPage.tsx",
          "operation": "modify",
          "description": "Update Seo props (title/description) to mention “Latest Government Jobs” and Nath Cyber Cafe; keep filtering in useMemo and pagination via slicing to avoid heavy client processing."
        },
        {
          "path": "frontend/src/lib/jobs/govJobsClient.ts",
          "operation": "modify",
          "description": "Add concise comments around parsing and normalization so future maintenance is clear; keep the mapping logic lightweight to support fast-loading behavior."
        },
        {
          "path": "frontend/src/lib/jobs/jobFiltering.ts",
          "operation": "modify",
          "description": "Add concise comments and ensure filtering does not do unnecessary work (e.g., avoid repeated heavy string building beyond what is needed for title/qualification matching)."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add the generated government-style emblem image as a static asset and render it in the Jobs page header.",
      "acceptanceCriteria": [
        "The emblem image exists in frontend/public/assets/generated with the filename specified in imageRequirements.required.",
        "The Jobs page header renders the emblem with appropriate alt text and responsive sizing."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/gov-emblem.dim_256x256.png",
          "operation": "create",
          "description": "Add the generated image asset exactly as specified: frontend/public/assets/generated/gov-emblem.dim_256x256.png."
        },
        {
          "path": "frontend/src/pages/JobsPage.tsx",
          "operation": "modify",
          "description": "Render the emblem image from frontend/public/assets/generated/gov-emblem.dim_256x256.png in the Jobs page header with appropriate alt text and responsive sizing."
        }
      ]
    }
  ]
}